# 一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？

# x + 100 = b * b, x + 268 = a * a
# (a + b) * (a - b) = 168
# p = a + b, q = a - b =>  a = p - b, b = a - q => p * q = 168, p, q 一奇一偶或者都是偶数
# a = (p + q) / 2, b = (p - q) / 2, a,b都是整数且a > b =>p, q 都是偶数 且  p >=2, q >= 2,  1 < p < 168 / 2 + 1 

max = int(168 / 2 + 1)
for p in range(1, max):
    if 168 % p == 0:
        q = 168 / p
        if p > q and (p + q) % 2 == 0 and (p - q) % 2 == 0:
            b = (p - q) / 2
            x = int(b * b - 100)
            print(x, "满足条件")