# 海滩上有一堆桃子，五只猴子来分。第一只猴子把这堆桃子平均分为五份，多了一个，这只猴子把多的一个扔入海中，拿走了一份。第二只猴子把剩下的桃子又平均分成五份，又多了一个，它同样把多的一个扔入海中，拿走了一份，第三、第四、第五只猴子都是这样做的，问海滩上原来最少有多少个桃子？

# 假设本轮猴子拿了 x 个桃子，则上轮剩下的桃子是 5 * x + 1，本轮剩下的桃子是 4 * x

# 假设最后一只猴子只拿了1个，则海滩上剩下4个桃子，那么上轮剩下的桃子是6，上轮猴子拿走了 6 / 4 不是整数，不符合实际

# 所以最后一个猴子拿到的最少的桃子且满足实际情况即可得到原来最少总共有多少桃子

i = 0 # 第几只猴子分
monkeyStart = 1 # 最后一个猴子拿的数量

monkeyGet = monkeyStart # 用于计算的当前猴子获取量
result = 5 * monkeyGet + 1 # 上轮桃子剩余量，计算到最后就是初始桃子

while i < 4: # 第一只猴子是默认值，所以只需要计算四次
    if result % 4 != 0: # 根据剩余量计算上一轮猴子拿取量，无法除尽证明起始值不对，增加起始值重新计算
        i = 0
        monkeyStart += 1
        monkeyGet = monkeyStart
        result = 5 * monkeyGet + 1
    else:
        monkeyGet = int(result / 4)
        result = 5 * monkeyGet + 1
        i += 1

print(result)
        